In [1]:
#import the libraries
import numpy as np
import pandas as pd

In [2]:
#read the data
data = pd.read_csv('cars.csv')

In [3]:
# check the data head
data.head(n=2)

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False

In [5]:
# create a new column for country that is upper case country name
for i , col in data.iterrows():
    data.loc[i , 'COUNTRY']=col['country'].upper()

In [7]:
data.head()

  Unnamed: 0  cars_per_cap        country  drives_right        COUNTRY
0         US           809  United States          True  UNITED STATES
1        AUS           731      Australia         False      AUSTRALIA
2        JAP           588          Japan         False          JAPAN
3         IN            18          India         False          INDIA
4         RU           200         Russia          True         RUSSIA

In [8]:
# the above method included the use of row iterations
# I can do the same without iterrations using apply()
data['COUNTRY_1']=data['COUNTRY'].apply(str.upper)

In [9]:
data

,Unnamed: 0,cars_per_cap,country,drives_right,COUNTRY,COUNTRY_1
0,US,809,United States,True,UNITED STATES,UNITED STATES
1,AUS,731,Australia,False,AUSTRALIA,AUSTRALIA
2,JAP,588,Japan,False,JAPAN,JAPAN
3,IN,18,India,False,INDIA,INDIA
4,RU,200,Russia,True,RUSSIA,RUSSIA
5,MOR,70,Morocco,True,MOROCCO,MOROCCO
6,EG,45,Egypt,True,EGYPT,EGYPT

In [10]:
data.COUNTRY_1 =data.COUNTRY.apply(str.lower)

In [11]:
data.head()

,Unnamed: 0,cars_per_cap,country,drives_right,COUNTRY,COUNTRY_1
0,US,809,United States,True,UNITED STATES,united states
1,AUS,731,Australia,False,AUSTRALIA,australia
2,JAP,588,Japan,False,JAPAN,japan
3,IN,18,India,False,INDIA,india
4,RU,200,Russia,True,RUSSIA,russia

# So I can manipulate a given column like changing its case (for string data)
# by using iterrows , data['xyz']=data['XYZ'].apply(str.lower)
# by using data.xyz=data.XYZ.apply(str.lower)

In [16]:
# Task take a list and print every element of it
mylist = [1,2,3,4,'a','b','c']
for i , item in enumerate(mylist):
    print('The Index is {} for the item {} in the list' .format(i , item))

The Index is 0 for the item 1 in the list
The Index is 1 for the item 2 in the list
The Index is 2 for the item 3 in the list
The Index is 3 for the item 4 in the list
The Index is 4 for the item a in the list
The Index is 5 for the item b in the list
The Index is 6 for the item c in the list

# loc and iloc
In iloc I index the dataframe with its integer index.
loc index the dataframe using the column name

In [18]:
data

,Unnamed: 0,cars_per_cap,country,drives_right,COUNTRY,COUNTRY_1
0,US,809,United States,True,UNITED STATES,united states
1,AUS,731,Australia,False,AUSTRALIA,australia
2,JAP,588,Japan,False,JAPAN,japan
3,IN,18,India,False,INDIA,india
4,RU,200,Russia,True,RUSSIA,russia
5,MOR,70,Morocco,True,MOROCCO,morocco
6,EG,45,Egypt,True,EGYPT,egypt

In [17]:
print(data.iloc[:,:-1]) # print all rows except the last column -- the column COUNTRY_1 was not printed

  Unnamed: 0  cars_per_cap        country  drives_right        COUNTRY
0         US           809  United States          True  UNITED STATES
1        AUS           731      Australia         False      AUSTRALIA
2        JAP           588          Japan         False          JAPAN
3         IN            18          India         False          INDIA
4         RU           200         Russia          True         RUSSIA
5        MOR            70        Morocco          True        MOROCCO
6         EG            45          Egypt          True          EGYPT

In [19]:
# dataframe.iloc[<row_selection>, <column_selection>]
# dataframe.loc[<row_selection>,<column_selection>]

In [21]:
data.iloc[0]# prints the zero row

Unnamed: 0                 US
cars_per_cap              809
country         United States
drives_right             True
COUNTRY         UNITED STATES
COUNTRY_1       united states
Name: 0, dtype: object

In [22]:
data.iloc[1] # prints the the second row

Unnamed: 0            AUS
cars_per_cap          731
country         Australia
drives_right        False
COUNTRY         AUSTRALIA
COUNTRY_1       australia
Name: 1, dtype: object

In [23]:
data.iloc[-1]# print the last row

Unnamed: 0         EG
cars_per_cap       45
country         Egypt
drives_right     True
COUNTRY         EGYPT
COUNTRY_1       egypt
Name: 6, dtype: object

In [24]:
data.iloc[:,0] # print the first column

0     US
1    AUS
2    JAP
3     IN
4     RU
5    MOR
6     EG
Name: Unnamed: 0, dtype: object

In [25]:
data.iloc[:,1] # print the second column

0    809
1    731
2    588
3     18
4    200
5     70
6     45
Name: cars_per_cap, dtype: int64

In [26]:
#print a selection of rows -- 5 in this case
data.iloc[0:5]

,Unnamed: 0,cars_per_cap,country,drives_right,COUNTRY,COUNTRY_1
0,US,809,United States,True,UNITED STATES,united states
1,AUS,731,Australia,False,AUSTRALIA,australia
2,JAP,588,Japan,False,JAPAN,japan
3,IN,18,India,False,INDIA,india
4,RU,200,Russia,True,RUSSIA,russia

In [27]:
data.iloc[:,0:2] # print the two columns and all the rows

  Unnamed: 0  cars_per_cap
0         US           809
1        AUS           731
2        JAP           588
3         IN            18
4         RU           200
5        MOR            70
6         EG            45

In [28]:
data.iloc[[0,2,3],[0,2,5]]# custom rows and columns

  Unnamed: 0        country      COUNTRY_1
0         US  United States  united states
2        JAP          Japan          japan
3         IN          India          india

In [29]:
# choosing contagious rows and columns
data.iloc[0:2,3:5]

   drives_right        COUNTRY
0          True  UNITED STATES
1         False      AUSTRALIA

In [34]:
data.head()

,Unnamed: 0,cars_per_cap,drives_right,COUNTRY,COUNTRY_1
country,,,,,
United States,US,809,True,UNITED STATES,united states
Australia,AUS,731,False,AUSTRALIA,australia
Japan,JAP,588,False,JAPAN,japan
India,IN,18,False,INDIA,india
Russia,RU,200,True,RUSSIA,russia

In [36]:
# now country name is set as the index
data.loc['United States'] # only row which has the lcountry name as United States

Unnamed: 0                 US
cars_per_cap              809
drives_right             True
COUNTRY         UNITED STATES
COUNTRY_1       united states
Name: United States, dtype: object

In [38]:
#select two rows 
data.loc[['United States','India']]

,Unnamed: 0,cars_per_cap,drives_right,COUNTRY,COUNTRY_1
country,,,,,
United States,US,809,True,UNITED STATES,united states
India,IN,18,False,INDIA,india

In [39]:
# use the loc to select rows and columns
data.loc[['United States', 'India'],['drives_right','cars_per_cap']]

               drives_right  cars_per_cap
country
United States          True           809
India                 False            18

In [42]:
#select with index values 'United States' , 'India'  with all columns between cars_per_cap , drives_right
data.loc['United States':'India',['drives_right','cars_per_cap']]

               drives_right  cars_per_cap
country
United States          True           809
Australia             False           731
Japan                 False           588
India                 False            18

In [44]:
# do the reverse
data.loc[['United States','India'],'drives_right':'COUNTRY_1']

               drives_right        COUNTRY      COUNTRY_1
country
United States          True  UNITED STATES  united states
India                 False          INDIA          india

# Boolean Operations on pandas dataframe

In [53]:
data.loc[data['COUNTRY']=='United States'.upper(), 'drives_right']

country
United States    True
Name: drives_right, dtype: bool

In [54]:
sample = data.loc[data['COUNTRY']=='United States'.upper(), 'drives_right']

In [55]:
type(sample)  # results a series

pandas.core.series.Series

In [49]:
sample = data.loc[data['COUNTRY']=='United States'.upper(), ['drives_right']]

In [51]:
type(sample) # results a dataframe

pandas.core.frame.DataFrame

In [57]:
#select the drives type for the for all country = India

data.loc[data['COUNTRY']=='India'.upper(),['cars_per_cap' , 'drives_right']]

         cars_per_cap  drives_right
country
India              18         False

In [59]:
# data.loc[data['email'].str.endswith('gmail.com') & data['first_name']=='Anthony']
data.loc[data['COUNTRY'].isin(['UNITED STATES' , 'INDIA' ,'JAPAN'])]

,Unnamed: 0,cars_per_cap,drives_right,COUNTRY,COUNTRY_1
country,,,,,
United States,US,809,True,UNITED STATES,united states
Japan,JAP,588,False,JAPAN,japan
India,IN,18,False,INDIA,india